app/views/users/show.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
            <%= link_to image_tag(post.user.avatar,height: '25px', width: '25px'), post.user %>
            <span class="postAuthor"><%= link_to post.user.firstname, post.user %></span>