app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `firstname` = '', `lastname` = '', `avatar_file_name` = 'dp.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 17744, `avatar_updated_at` = '2013-10-08 14:14:09', `updated_at` = '2013-10-08 14:14:10' WHERE `users`.`id` = 3

  def set_user
    # CR_Priyank: I think we do not need to check if params[:id]
    # [Discuss]
    if(params[:id])
      @user = User.find_by(id: params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1